In [20]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
data2 = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','Maneesh'],
       'Sales':[200,120,340,124,243,350,420]}

In [26]:
data2

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah', 'Maneesh'],
 'Sales': [200, 120, 340, 124, 243, 350, 420]}

In [28]:
df=pd.DataFrame(data2)

In [29]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350
6      FB  Maneesh    420

In [30]:
bycom=df.groupby('Company')

In [31]:
bycom

In [32]:
bycom.mean()

              Sales
Company
FB       337.666667
GOOG     160.000000
MSFT     232.000000

In [33]:
bycom.std()

              Sales
Company
FB        89.142208
GOOG      56.568542
MSFT     152.735065

In [35]:
df.groupby('Company').count()

         Person  Sales
Company
FB            3      3
GOOG          2      2
MSFT          2      2

In [25]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [36]:
df.groupby('Company').describe()

        Sales
        count        mean         std    min    25%    50%    75%    max
Company
FB        3.0  337.666667   89.142208  243.0  296.5  350.0  385.0  420.0
GOOG      2.0  160.000000   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.000000  152.735065  124.0  178.0  232.0  286.0  340.0

In [37]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    3.000000    2.000000    2.000000
      mean   337.666667  160.000000  232.000000
      std     89.142208   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    296.500000  140.000000  178.000000
      50%    350.000000  160.000000  232.000000
      75%    385.000000  180.000000  286.000000
      max    420.000000  200.000000  340.000000